practice-for-ch-rails-music-app-long-practice-main/music_app/app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
    def show
        @user = User.find(params[:email])